docs/dev-docs/strategy.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 Tue 00:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Islands development strategy and tasks</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Konstantin" />
</head>
<body>
<div id="content">
<h1 class="title">Islands development strategy and tasks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f1db17">1. Current tasks</a>
<ul>
<li><a href="#org3be6b8d">1.1. <span class="todo PROJ">PROJ</span> Optimize invite mechanism, reduce delay and improve feedback</a></li>
<li><a href="#org0102d7d">1.2. <span class="todo TODO">TODO</span> Update npm libraries, fix npm issues</a></li>
<li><a href="#orgc5360ba">1.3. <span class="todo TODO">TODO</span> Indicator in tab if there are new messages</a></li>
<li><a href="#orgf0bb9d6">1.4. <span class="todo TODO">TODO</span> Switch Islands | topic name</a></li>
<li><a href="#orgce86e11">1.5. <span class="todo TODO">TODO</span> White spaces in messages</a></li>
<li><a href="#org25276db">1.6. <span class="todo TODO">TODO</span> Scrolling behavior</a></li>
</ul>
</li>
<li><a href="#orgdb185cb">2. Bugs</a>
<ul>
<li><a href="#orgff1910e">2.1. <span class="todo TODO">TODO</span> In settings there should be not boot button for those who has no rights</a></li>
<li><a href="#org95c8917">2.2. <span class="todo TODO">TODO</span> test EDGE browser</a></li>
</ul>
</li>
<li><a href="#orgd2945a8">3. Feature requests</a>
<ul>
<li><a href="#org3651980">3.1. Backup strategy <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-08 Sun&gt;</span></span></a></li>
<li><a href="#orgb654b3a">3.2. Admin panel should not replace vault <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-08 Sun&gt;</span></span></a></li>
<li><a href="#orgf7f63ee">3.3. <span class="todo PROJ">PROJ</span> Different colors per user</a></li>
<li><a href="#org4833fba">3.4. <span class="todo PROJ">PROJ</span> Ability to mute/unmute particular partivipant</a></li>
<li><a href="#org14fa0d3">3.5. <span class="todo TODO">TODO</span> Volume control instead of mute button</a></li>
<li><a href="#org23697ac">3.6. <span class="todo PROJ">PROJ</span> Implement /commands</a>
<ul>
<li><a href="#org86dbadc">3.6.1. <span class="todo TODO">TODO</span> Implement /version command that gives the version report for tech support</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge65ec4c">4. Completed</a>
<ul>
<li><a href="#orgd482f5f">4.1. <span class="done DONE">DONE</span> Islnad console login bug <code>[100%]</code></a>
<ul>
<li><a href="#orgd1ff26d">4.1.1. <span class="done DONE">DONE</span> Fix VM prepare script</a></li>
<li><a href="#org296d86c">4.1.2. <span class="done DONE">DONE</span> Fix VM setup script such that it is impossible to login into island other than via ssh.</a></li>
<li><a href="#org2571f8a">4.1.3. <span class="done DONE">DONE</span> Script for updating stats in 1sec intervals to communicat with host</a></li>
<li><a href="#org2b1a398">4.1.4. <span class="done DONE">DONE</span> Implement script to capture public key when island boots for the first time.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1f1db17" class="outline-2">
<h2 id="org1f1db17"><span class="section-number-2">1</span> Current tasks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3be6b8d" class="outline-3">
<h3 id="org3be6b8d"><span class="section-number-3">1.1</span> <span class="todo PROJ">PROJ</span> Optimize invite mechanism, reduce delay and improve feedback</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-06 Fri&gt;</span></span>
</p>
</div>
</div>


<div id="outline-container-org0102d7d" class="outline-3">
<h3 id="org0102d7d"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Update npm libraries, fix npm issues</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-10 Tue&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-orgc5360ba" class="outline-3">
<h3 id="orgc5360ba"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Indicator in tab if there are new messages</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-10 Tue&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-orgf0bb9d6" class="outline-3">
<h3 id="orgf0bb9d6"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> Switch Islands | topic name</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-10 Tue&gt;</span></span>
</p>
</div>
</div>

<div id="outline-container-orgce86e11" class="outline-3">
<h3 id="orgce86e11"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> White spaces in messages</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-10 Tue&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-org25276db" class="outline-3">
<h3 id="org25276db"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> Scrolling behavior</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-10 Tue&gt;</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-orgdb185cb" class="outline-2">
<h2 id="orgdb185cb"><span class="section-number-2">2</span> Bugs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgff1910e" class="outline-3">
<h3 id="orgff1910e"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> In settings there should be not boot button for those who has no rights</h3>
</div>
<div id="outline-container-org95c8917" class="outline-3">
<h3 id="org95c8917"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> test EDGE browser</h3>
</div>
</div>

<div id="outline-container-orgd2945a8" class="outline-2">
<h2 id="orgd2945a8"><span class="section-number-2">3</span> Feature requests</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3651980" class="outline-3">
<h3 id="org3651980"><span class="section-number-3">3.1</span> Backup strategy <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-08 Sun&gt;</span></span></h3>
</div>
<div id="outline-container-orgb654b3a" class="outline-3">
<h3 id="orgb654b3a"><span class="section-number-3">3.2</span> Admin panel should not replace vault <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-08 Sun&gt;</span></span></h3>
</div>
<div id="outline-container-orgf7f63ee" class="outline-3">
<h3 id="orgf7f63ee"><span class="section-number-3">3.3</span> <span class="todo PROJ">PROJ</span> Different colors per user</h3>
</div>
<div id="outline-container-org4833fba" class="outline-3">
<h3 id="org4833fba"><span class="section-number-3">3.4</span> <span class="todo PROJ">PROJ</span> Ability to mute/unmute particular partivipant</h3>
</div>
<div id="outline-container-org14fa0d3" class="outline-3">
<h3 id="org14fa0d3"><span class="section-number-3">3.5</span> <span class="todo TODO">TODO</span> Volume control instead of mute button</h3>
</div>
<div id="outline-container-org23697ac" class="outline-3">
<h3 id="org23697ac"><span class="section-number-3">3.6</span> <span class="todo PROJ">PROJ</span> Implement /commands</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-org86dbadc" class="outline-4">
<h4 id="org86dbadc"><span class="section-number-4">3.6.1</span> <span class="todo TODO">TODO</span> Implement /version command that gives the version report for tech support</h4>
</div>
</div>
</div>


<div id="outline-container-orge65ec4c" class="outline-2">
<h2 id="orge65ec4c"><span class="section-number-2">4</span> Completed</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd482f5f" class="outline-3">
<h3 id="orgd482f5f"><span class="section-number-3">4.1</span> <span class="done DONE">DONE</span> Islnad console login bug <code>[100%]</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
START: <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-09-06 Fri&gt;</span></span>
</p>
</div>
<div id="outline-container-orgd1ff26d" class="outline-4">
<h4 id="orgd1ff26d"><span class="section-number-4">4.1.1</span> <span class="done DONE">DONE</span> Fix VM prepare script</h4>
<div class="outline-text-4" id="text-4-1-1">
</div>
</div>
<div id="outline-container-org296d86c" class="outline-4">
<h4 id="org296d86c"><span class="section-number-4">4.1.2</span> <span class="done DONE">DONE</span> Fix VM setup script such that it is impossible to login into island other than via ssh.</h4>
<div class="outline-text-4" id="text-4-1-2">
</div>
</div>
<div id="outline-container-org2571f8a" class="outline-4">
<h4 id="org2571f8a"><span class="section-number-4">4.1.3</span> <span class="done DONE">DONE</span> Script for updating stats in 1sec intervals to communicat with host</h4>
<div class="outline-text-4" id="text-4-1-3">
</div>
</div>
<div id="outline-container-org2b1a398" class="outline-4">
<h4 id="org2b1a398"><span class="section-number-4">4.1.4</span> <span class="done DONE">DONE</span> Implement script to capture public key when island boots for the first time.</h4>
<div class="outline-text-4" id="text-4-1-4">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Konstantin</p>
<p class="date">Created: 2019-09-10 Tue 00:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
